/*
프로젝트: 'cargo new'에 의해 만들어지는, Rust 프로그램을 만들기 위한 모든 리소스의 모음

Rust로 어떤 프로그램을 만들고자 할 때, 제일 먼저 하는 작업은 cargo new [프로젝트 이름]이다.
-> cargo 이용하지 않고도 만들 수 있지만, ...
프로젝트 폴더에는 Cargo.toml 파일이 있는데, 이 파일이 패키지를 정의해 준다.

패키지: 하나 이상의 크레이트로 이루어진 것으로, 프로젝트를 구성하는 최상위 개념.
패키지의 이름, 어떤 크레이트와 종속성이 있는지 등은 Cargo.toml 파일에 기술된다.

크레이트: Rust가 컴파일되는 단위. 크레이트는 여러 모듈을 담을 수 있고, 여러 파일로 구성될 수도 있다.

크레이트는 두 가지 종류가 있다.

- 바이너리 크레이트
main 함수를 포함하고 있어서 실행 가능한 프로그램으로 컴파일이 가능한 크레이트
- 라이브러리 크레이트
main 함수를 포함하고 있지 않아서 실행 가능한 프로그램으로 컴파일이 되지 않는다.
대신에 다른 프로젝트에서 공용으로 사용할 수 있는 기능들을 포함하고 있다.
일반적으로 크레이트라고 하면 라이브러리 크레이트를 의미한다.

크레이트 생성은 다음과 같이 한다.
cargo new <프로젝트명> --bin: 바이너리 크레이트 생성. src/main.rs가 생성됨
cargo new <프로젝트명> --lib: 라이브러리 크레이트 생성. src/lib.rs가 생성됨
cargo new <프로젝트명>: --bin이 있는 것으로 간주되어 바이너리 크레이트가 생성된다.

크레이트 루트는 '루트 모듈(root module)'을 만들어 내는 메인이 되는 소스 파일을 말한다.
Rust 컴파일러는 크레이트를 만들기 위해 '크레이트 루트' 파일을 시작으로 해서 컴파일을 해 나간다.
크레이트 루트는 '바이너리 크레이트'의 경우는 'src/main.rs'가 되고, '라이브러리 크레이트'의 경우는 'src/lib.rs'가 된다.

모듈: 크레이트를 구성하는 요소. mod [모듈명]으로 모듈을 선언해서 생성하기도 하고,
별도의 파일로 소스코드를 나눠서 별도의 모듈이 되게할 수도 있다.

프로그램이 커지면 여러 개의 소스 파일로 나눠서 프로그램을 개발하고 된다.
Rust에서는 각각의 파일이 하나의 모듈이다. 그리고, 한 파일안에서도 mod [모듈명]으로 모듈을 만들 수도 있다.

모듈의 선언

main.rs 파일에서 mod garden { } 이라고 하면 main 모듈 밑에 garden 모듈이 생성되는 것이다.
이 모듈 안에 코드들을 넣을 수 있고, 또 다른 서브 모듈을 생성할 수도 있다.

(1) main.rs 파일에서 mod garden {}을 하면 메인 모듈 밑에 'garden'이라는 모듈이 생성된다.
pub 키워드를 붙이지 않았다. main에서 사용할 것이고, main 바로 밑에 있는 모듈이기에 pub을 붙이지 않아도 접근이 가능하다.
(2) 'garden' 모듈 밑에 'vegetable'이라는 서브 모듈을 만든 것이다. 이 모듈을 메인 모듈에서 접근하려면 pub을 붙여서  선언해야한다.
왜냐면, garden 바로 밑에 있는 것이기에 garden 모듈에서는 pub가 없어도 접근 가능하지만, 메인에서는 garden에 막혀서 접근이 안된다.
따라서 pub을 붙여줘야 main에서 접근이 가능하다.
(3) vegetable 모듈 안에서 구조체 하나를 선언했다. 이 구조체도 main에서 접근하려면 pub을 붙여줘야 한다.
(4) 메인에서 접근할 때는 garden::vegetables::Asparagus {} 처럼 계층구조를 명시해서 접근한다.
혹은 use를 써서 계층구조를 미리 사용한다고 선언 후에 사용할 수도 있다.
*/

mod garden {
    // (1)
    pub mod vegetables {
        // (2)
        #[derive(Debug)]
        pub struct Asparagus {} // (3)
    }
}

pub fn run() {
    let plant = garden::vegetables::Asparagus {};
    println!("I'm growing {:?}", plant);
}
